import './App.css'
import Item from './components/Items/Items'


let places = [
  {
    name:'Олеський замок -',
    price:'200грн',
    location:'Олесько',
    img:0,
    description:"Цей замок оповитий легендами не менше. І тут теж, подейкують, є примари – чеського ченця Яна Каспера, а також двох закоханих. Але не будемо про містику. Перш за все, замок поблизу селища Олесько – це пам'ятник архітектури XIV-XVII століть, в якому сьогодні розташовується галерея мистецтв, яка налічує понад 500 експонатів."
  },
  {
    name:'Печерний монастир -',
    price:'бесплатно',
    location:'Розгірче ',
    img:1,
    description:"Невелике село Розгірче може похвалитися однією з найбільш незвичайних визначних пам'яток України – печерним монастирем XV століття. Поблизу є залишки стародавнього городища приблизно того ж періоду.Однак задовго до появи ченців у цих місцях жили люди: під час археологічної експедиції 25 років тому були знайдені сліди життєдіяльності певного поселення, яке існувало в VIII-VII століттях до нашої ери."
  },
  {
    name:'Чортів Камень -',
    price:'бесплатнO',
    location:'Підкамінь ',
    img:2,
    description:"Природний пам'ятник у селищі Підкамінь Бродівського району. Висота каменю – 16 метрів, і від нього, за розповідями місцевих жителів, виходить просто неймовірна енергетика. Справжнє місце сили.Цій породі імовірно до 15 мільйонів років. Камінь міг утворитися ще на дні Сарматського моря, яке колись було в цих краях. Біля каменю були виявлені сліди язичницьких жертвоприношень, а також козацькі поховання XVII-XVIII століть. За декілька сотень метрів від нього стоїть Домініканський монастир."
  
  },
]

function App() {
  return (
    <div className="App">
      <h1 className='header'>Проведи літо з користю</h1>
      {places.map((item) => <Item key={item.name} name={item.name} price={item.price} location={item.location} img={item.img} description={item.description}/>)}
    </div>
  );
}

export default App;
